#+title: Automatically Generating Rules for Diospyros

The top-level goal is to have some kind of "push-button" automation that can generate our egg rules for us. We of course need to give this tool some kind of description of our problem.

The description that =ruler= needs at the moment is an interpreter for the language. This is a simple thing to provide and is much more straightforward to reason about from a human perspective. In contrast, the process of figuring out the right rewrite rules that work well is difficult and error prone.

I'm thinking that it might be useful to also bring the =dios= cost function into the picture. Hopefully this can guide which rules seem important. At the very least, it might provide some metric for deciding which rules are "good".

* By hand exploration
:PROPERTIES:
:header-args: :dir (magit-toplevel)
:END:

Let's start by just looking at a dios program, looking at the cost function, and looking at some ruler generated rules and seeing if there seems like there is some path to go from the ruler generated rules to a "good" set of rules procedurally.

I'm going to be looking for rules that "enable" other rules, in particular enable rules that lower the cost function. I also want to look and see if there is a way to guess that we want to generate vector rules based on the cost function.

** q-prod spec

#+begin_src emacs-lisp
(Concat
  (Vec
    (+
      (+
        (* (Get aq 3) (Get bq 0))
        (+ (* (Get aq 0) (Get bq 3)) (* (Get aq 1) (Get bq 2))))
      (neg (* (Get aq 2) (Get bq 1))))
    (+
      (+
        (* (Get aq 3) (Get bq 1))
        (+ (* (Get aq 1) (Get bq 3)) (* (Get aq 2) (Get bq 0))))
      (neg (* (Get aq 0) (Get bq 2)))))
  (Concat
    (Vec
      (+
        (+
          (* (Get aq 3) (Get bq 2))
          (+ (* (Get aq 2) (Get bq 3)) (* (Get aq 0) (Get bq 1))))
        (neg (* (Get aq 1) (Get bq 0))))
      (+
        (* (Get aq 3) (Get bq 3))
        (+
          (neg (* (Get aq 0) (Get bq 0)))
          (+ (neg (* (Get aq 1) (Get bq 1))) (neg (* (Get aq 2) (Get bq 2)))))))
    (Concat
      (Vec
        (+
          (Get at 0)
          (+
            (Get bt 0)
            (+
              (+
                (*
                  (Get aq 1)
                  (* 2 (+ (* (Get aq 0) (Get bt 1)) (neg (* (Get aq 1) (Get bt 0))))))
                (neg
                  (*
                    (Get aq 2)
                    (* 2 (+ (* (Get aq 2) (Get bt 0)) (neg (* (Get aq 0) (Get bt 2))))))))
              (*
                (Get aq 3)
                (* 2 (+ (* (Get aq 1) (Get bt 2)) (neg (* (Get aq 2) (Get bt 1)))))))))
        (+
          (Get at 1)
          (+
            (Get bt 1)
            (+
              (+
                (*
                  (Get aq 2)
                  (* 2 (+ (* (Get aq 1) (Get bt 2)) (neg (* (Get aq 2) (Get bt 1))))))
                (neg
                  (*
                    (Get aq 0)
                    (* 2 (+ (* (Get aq 0) (Get bt 1)) (neg (* (Get aq 1) (Get bt 0))))))))
              (*
                (Get aq 3)
                (* 2 (+ (* (Get aq 2) (Get bt 0)) (neg (* (Get aq 0) (Get bt 2))))))))))
      (Vec
        (+
          (Get at 2)
          (+
            (Get bt 2)
            (+
              (+
                (*
                  (Get aq 0)
                  (* 2 (+ (* (Get aq 2) (Get bt 0)) (neg (* (Get aq 0) (Get bt 2))))))
                (neg
                  (*
                    (Get aq 1)
                    (* 2 (+ (* (Get aq 1) (Get bt 2)) (neg (* (Get aq 2) (Get bt 1))))))))
              (*
                (Get aq 3)
                (* 2 (+ (* (Get aq 0) (Get bt 1)) (neg (* (Get aq 1) (Get bt 0)))))))))
        0))))
#+end_src

** cost function

#+begin_example
const LITERAL: f64 = 0.001;
const STRUCTURE: f64 = 0.1;
const VEC_OP: f64 = 1.;
const OP: f64 = 1.;
const BIG: f64 = 100.0;
let op_cost = match enode {
    // You get literals for extremely cheap
    VecLang::Num(..) => LITERAL,
    VecLang::Symbol(..) => LITERAL,
    VecLang::Get(..) => LITERAL,

    // And list structures for quite cheap
    VecLang::List(..) => STRUCTURE,
    VecLang::Concat(..) => STRUCTURE,

    // Vectors are cheap if they have literal values
    VecLang::Vec(vals) => {
        // For now, workaround to determine if children are num, symbol,
        // or get
        let non_literals = vals.iter().any(|&x| costs(x) > 3. * LITERAL);
        if non_literals {
            BIG
        } else {
            STRUCTURE
        }
    }
    VecLang::LitVec(..) => LITERAL,

    // But scalar and vector ops cost something
    VecLang::Add(vals) => OP * (vals.iter().count() as f64 - 1.),
    VecLang::Mul(vals) => OP * (vals.iter().count() as f64 - 1.),
    VecLang::Minus(vals) => OP * (vals.iter().count() as f64 - 1.),
    VecLang::Div(vals) => OP * (vals.iter().count() as f64 - 1.),

    VecLang::Sgn(..) => OP,
    VecLang::Neg(..) => OP,
    VecLang::Sqrt(..) => OP,

    VecLang::VecAdd(..) => VEC_OP,
    VecLang::VecMinus(..) => VEC_OP,
    VecLang::VecMul(..) => VEC_OP,
    VecLang::VecMAC(..) => VEC_OP,
    VecLang::VecDiv(..) => VEC_OP,
    VecLang::VecNeg(..) => VEC_OP,
    VecLang::VecSqrt(..) => VEC_OP,
    VecLang::VecSgn(..) => VEC_OP,
    _ => VEC_OP,
};
#+end_example

Seems like basically the way that the cost function works is that it strongly penalizes =Vec= from having large children. In other words, we want to push =Vec= as far in as possible and have =VecOp= be the top level nodes.

I wonder if we can figure that out by scoring some of the rules.

** Hand scoring some rules

#+begin_example
(Vec (+ ?a0 ?b0) (+ ?a1 ?b1)) => (VecAdd (Vec ?a0 ?a1) (Vec ?b0 ?b1))
#+end_example

This rule does the thing of pushing =Vec= down the tree. What is it's cost?

LHS: =BIG + (OP * 2) + (OP * 2) + (LITERAL * 4)= = 104.004
RHS: =VEC_OP + (2 * STRUCTURE) + (LITERAL * 4)= = 1.204

Ok, so the left hand side indeed as a much larger cost than the right hand side.

** Automate the scoring of rules

#+begin_src sh :results output
./scripts/filter.py t0.json
#+end_src

#+RESULTS:
#+begin_example
(VecMul (Vec ?a ?b) (Vec ?c ?d)) <=> (Vec (* ?a ?c) (* ?b ?d))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?c ?d)) <=> (Vec (+ ?a ?c) (+ ?b ?d))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?c ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b ?c)) <=> (Vec (+ ?a ?b) (+ ?c ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b ?c)) <=> (Vec (+ ?a ?b) (+ ?a ?c))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b ?c)) <=> (Vec (+ ?a ?b) (+ ?c ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?a ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?b ?c))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b ?c)) <=> (Vec (+ ?a ?b) (+ ?b ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a ?c)) <=> (Vec (* ?a ?a) (* ?b ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?c ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?a ?c)) <=> (Vec (+ ?a ?a) (+ ?b ?c))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec ?a (+ ?b ?c))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b ?c)) <=> (Vec ?b (* ?c ?a))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 1 ?c)) <=> (Vec ?a (* ?c ?b))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 1 ?c)) <=> (Vec ?a (* ?b ?c))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b ?c)) <=> (Vec ?b (* ?a ?c))
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (+ ?b ?a) ?c)
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (+ ?a ?c) ?b)
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (+ ?c ?a) ?b)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (+ ?a ?b) ?c)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?c 1)) <=> (Vec (* ?a ?c) ?b)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b ?c)) <=> (Vec (* ?a ?b) ?c)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b ?c)) <=> (Vec (* ?b ?a) ?c)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?c 1)) <=> (Vec (* ?c ?a) ?b)
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec ?b (+ ?a ?c))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec ?b (+ ?c ?a))
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec ?a (+ ?c ?b))
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?c ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec 0 (* ?c ?a))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec 0 (* ?b ?c))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec 0 (* ?c ?b))
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec ?c 1)) <=> (Vec (+ ?a ?c) (+ 1 ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* ?c 0) (* ?c ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* ?c 0) (* ?c ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* ?b 0) (* ?b ?c))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* ?a 0) (* ?a ?c))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?c 1)) <=> (Vec (+ ?a ?c) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?c)) <=> (Vec (+ ?b ?a) (+ ?c 1))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?c 1)) <=> (Vec (+ ?c ?a) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?c)) <=> (Vec (+ ?a ?b) (+ ?c 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?c)) <=> (Vec (+ ?a ?b) (+ 1 ?c))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?c 1)) <=> (Vec (+ ?c ?a) (+ 1 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?c)) <=> (Vec (+ ?b ?a) (+ 1 ?c))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?c)) <=> (Vec (+ ?b 1) (+ ?c ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?c)) <=> (Vec (+ ?a 1) (+ ?c ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?c)) <=> (Vec (+ ?a 1) (+ ?b ?c))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?c)) <=> (Vec (+ ?b 1) (+ ?a ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec ?c ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* ?a 0) (* ?c ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec ?b ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec ?b ?b) (Vec 0 ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec ?c ?b) (Vec 0 ?c))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* ?b 0) (* ?a ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?b) (Vec 0 ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* ?a 0) (* ?b ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?b) (Vec ?c ?c))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* ?b 0) (* ?c ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* 0 ?c) (* ?b ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* 0 ?b) (* ?c ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* 0 ?c) (* ?a ?c))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* 0 ?a) (* ?c ?a))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec ?b ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec ?c ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?b) (Vec ?b ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?a 0) (Vec ?b ?b))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?a 0) (Vec ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?c ?a) (* ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?a 0) (Vec ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?b 0) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?a ?a) (Vec ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?b 0) (Vec ?a ?b))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?b ?b) (Vec ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?a ?c) (* ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?b ?a) (Vec ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?b ?a) (* ?c 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?b 0) (Vec ?a ?a))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?a ?b) (Vec ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?c 0))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?c)) <=> (Vec (+ 1 ?b) (+ ?c ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?c)) <=> (Vec (+ 1 ?a) (+ ?c ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?c)) <=> (Vec (+ 1 ?a) (+ ?b ?c))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?c)) <=> (Vec (+ 1 ?b) (+ ?a ?c))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?a ?b) (Vec ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?a ?c) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?c ?a) (* ?c 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?a ?c) (* 0 ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?c ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?a ?c) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?a ?c) (* ?c 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?b 0) (Vec ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* 0 ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?c ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?c ?a) (* ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?b ?a) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?b ?b) (Vec ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?a ?c) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?c 0)) <=> (Vec (* ?c ?a) (* 0 ?c))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?b ?a) (* 0 ?c))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?c)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?a 0) (Vec ?b ?a))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?a 0) (Vec ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?b 0) (Vec ?a ?b))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?b 0) (Vec ?a ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* 0 ?a) (* ?a ?c))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* 0 ?c) (* ?c ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* 0 ?b) (* ?b ?c))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec ?b ?b) (Vec 0 ?c))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 0 ?b) (Vec 0 ?c))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* 0 ?b) (* ?a ?c))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec ?c ?b) (Vec 0 ?c))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec ?c ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec ?c ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec ?b ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* 0 ?b) (* ?c ?a))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec ?b ?c) (Vec 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* 0 ?a) (* ?b ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* 0 ?c) (* ?c ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* 0 ?a) (* ?c ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* ?c 0) (* ?a ?c))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?c)) <=> (Vec (* ?a 0) (* ?c ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* ?c 0) (* ?b ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?c)) <=> (Vec (* ?b 0) (* ?c ?b))
cost: 100.80000000000001
(Vec (+ ?a ?b) (* ?c 0)) <=> (VecAdd (Vec ?a 0) (Vec ?b 0))
cost: 100.80000000000001
(Vec (+ ?a ?b) (* ?c 0)) <=> (VecAdd (Vec ?b 0) (Vec ?a 0))
cost: 100.80000000000001
(Vec (+ ?a ?b) (* 0 ?c)) <=> (VecAdd (Vec ?a 0) (Vec ?b 0))
cost: 100.80000000000001
(Vec (+ ?a ?b) (* 0 ?c)) <=> (VecAdd (Vec ?b 0) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (+ ?b ?c)) <=> (VecAdd (Vec 0 ?b) (Vec 0 ?c))
cost: 100.80000000000001
(Vec (* 0 ?a) (+ ?b ?c)) <=> (VecAdd (Vec 0 ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (+ ?b ?c)) <=> (VecAdd (Vec 0 ?b) (Vec 0 ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (+ ?b ?c)) <=> (VecAdd (Vec 0 ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 1 ?b) (Vec 0 ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?b) (Vec 1 ?c))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec 1 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?c)) <=> (VecMul (Vec 1 ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?a 0) (Vec ?b 1))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?b 1) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?a 1) (Vec ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* ?c 0)) <=> (VecMul (Vec ?b 0) (Vec ?a 1))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?a 1) (Vec ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?a 0) (Vec ?b 1))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?b 0) (Vec ?a 1))
cost: 100.80000000000001
(Vec (* ?a ?b) (* 0 ?c)) <=> (VecMul (Vec ?b 1) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 1 ?b) (Vec 0 ?c))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 0 ?c) (Vec 1 ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 1 ?c) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?c)) <=> (VecMul (Vec 0 ?b) (Vec 1 ?c))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b ?a)) <=> (Vec (* ?b ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b ?b)) <=> (Vec (* ?a ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b ?b)) <=> (Vec (* ?b ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b ?a)) <=> (Vec (* ?a ?b) (* ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b ?b)) <=> (Vec (+ ?b ?a) (+ ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b ?a)) <=> (Vec (+ ?a ?b) (+ ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?a ?b)) <=> (Vec (* ?a ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a ?a)) <=> (Vec (* ?a ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b ?a)) <=> (Vec (* ?a ?b) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b ?b)) <=> (Vec (* ?b ?a) (* ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?a ?b)) <=> (Vec (+ ?a ?a) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?a ?a)) <=> (Vec (+ ?a ?a) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b ?a)) <=> (Vec (+ ?b ?a) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b ?b)) <=> (Vec (+ ?a ?b) (+ ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?a ?b)) <=> (Vec (+ ?a ?a) (+ ?b ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b ?a)) <=> (Vec (* ?b ?a) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b ?b)) <=> (Vec (* ?a ?b) (* ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?a ?a)) <=> (Vec (+ ?a ?a) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?a ?b)) <=> (Vec (+ ?a ?a) (+ ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a ?b)) <=> (Vec (* ?a ?a) (* ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b ?a)) <=> (Vec (+ ?b ?a) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b ?b)) <=> (Vec (+ ?b ?a) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b ?b)) <=> (Vec (+ ?a ?b) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b ?a)) <=> (Vec (+ ?a ?b) (+ ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a ?a)) <=> (Vec (* ?a ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?a ?b)) <=> (Vec (* ?a ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?a ?b)) <=> (Vec (* ?a ?a) ?b)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?a 1)) <=> (Vec (* ?a ?a) ?b)
cost: 99.799
(VecMul (Vec ?a ?a) (Vec 1 ?b)) <=> (Vec ?a (* ?b ?a))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec ?b (+ ?a ?b))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec ?a (+ ?b ?a))
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec ?a (+ ?b ?a))
cost: 99.799
(VecAdd (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec ?a (+ ?b ?a))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b ?a)) <=> (Vec ?b (* ?a ?a))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 1 ?b)) <=> (Vec ?a (* ?b ?b))
cost: 99.799
(VecAdd (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec ?a (+ ?a ?b))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec ?a (+ ?a ?b))
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec ?a (+ ?a ?b))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec ?b (+ ?b ?a))
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b ?a)) <=> (Vec (* ?a ?b) ?a)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?b 1)) <=> (Vec (* ?b ?a) ?b)
cost: 99.799
(VecMul (Vec ?a ?a) (Vec ?b 1)) <=> (Vec (* ?a ?b) ?a)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b ?b)) <=> (Vec (* ?b ?a) ?b)
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?b ?a)) <=> (Vec ?b (+ ?a ?a))
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec 0 ?b)) <=> (Vec ?a (+ ?b ?b))
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (+ ?b ?a) ?b)
cost: 99.799
(VecAdd (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (+ ?a ?b) ?a)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (+ ?a ?b) ?a)
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (+ ?b ?a) ?b)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (+ ?a ?b) ?b)
cost: 99.799
(VecAdd (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (+ ?b ?a) ?a)
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (+ ?a ?b) ?b)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (+ ?b ?a) ?a)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 1 ?a)) <=> (Vec ?a (* ?b ?a))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b ?b)) <=> (Vec ?b (* ?a ?b))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?a ?b)) <=> (Vec ?a (* ?b ?a))
cost: 99.799
(VecAdd (Vec ?a ?b) (Vec ?a 0)) <=> (Vec (+ ?a ?a) ?b)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?a ?b)) <=> (Vec (+ ?a ?a) ?b)
cost: 99.799
(VecMul (Vec ?a ?a) (Vec ?b 1)) <=> (Vec (* ?b ?a) ?a)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b ?b)) <=> (Vec (* ?a ?b) ?b)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b ?a)) <=> (Vec (* ?b ?a) ?a)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?b 1)) <=> (Vec (* ?a ?b) ?b)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 1 ?a)) <=> (Vec ?a (* ?a ?b))
cost: 99.799
(VecMul (Vec ?a ?a) (Vec 1 ?b)) <=> (Vec ?a (* ?a ?b))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b ?b)) <=> (Vec ?b (* ?b ?a))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?a ?b)) <=> (Vec ?a (* ?a ?b))
cost: 99.799
(Vec ?a (* ?b 0)) <=> (Vec ?a 0)
cost: 100.901
(Vec (* ?a 0) ?b) <=> (Vec 0 ?b)
cost: 100.901
(VecMul (Vec ?a 1) (Vec ?b 1)) <=> (Vec (* ?a ?b) 1)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b 1)) <=> (Vec (* ?b ?a) 1)
cost: 99.799
(VecMul (Vec 1 ?a) (Vec 1 ?b)) <=> (Vec 1 (* ?b ?a))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec 1 ?b)) <=> (Vec 1 (* ?a ?b))
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?a ?b) 0)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?b ?a) 0)
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec 0 (+ ?a ?b))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec 0 (+ ?b ?a))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?a 0)) <=> (Vec (* ?a ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?a ?b)) <=> (Vec (* ?a ?a) 0)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec 0 (* ?b 0))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* ?b 0) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec 0 (* ?a 0))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* ?a 0) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec 0 (* ?a 0))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* ?a 0) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec 0 (* ?b 0))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* ?b 0) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?a) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?b) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec 0 (* 0 ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec 0 (* 0 ?b))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?b) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec 0 (* 0 ?b))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec 0 (* 0 ?a))
cost: 99.799
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec 0 (* ?a ?b))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec 0 (* ?a ?b))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec 0 (* ?a ?b))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec 0 (* ?b ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec 0 (* ?b ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec 0 (* ?b ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec 0 (* ?a ?b))
cost: 99.799
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec 0 (* ?b ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec 0 (* ?b ?a))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec 0 (* ?a ?b))
cost: 99.799
(VecMul (Vec ?a ?b) (Vec 0 ?b)) <=> (Vec 0 (* ?b ?b))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b ?a)) <=> (Vec (* ?a 0) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?a)) <=> (Vec (+ ?a 1) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b 1)) <=> (Vec (+ 1 ?b) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec 1 ?b)) <=> (Vec (+ 1 ?a) (+ ?b 1))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a ?b)) <=> (Vec (* ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?a)) <=> (Vec (+ ?b ?a) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec 1 ?b)) <=> (Vec (+ 1 ?a) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?b)) <=> (Vec (+ 1 ?b) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?a)) <=> (Vec (+ 1 ?a) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?a ?b)) <=> (Vec (+ 1 ?a) (+ ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* ?a 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec (* ?a 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* ?b 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* ?a 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* ?b 0) (* ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?b)) <=> (Vec (+ 1 ?a) (+ ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?a)) <=> (Vec (+ 1 ?b) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b 1)) <=> (Vec (+ ?a ?b) (+ 1 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b 1)) <=> (Vec (+ ?b ?a) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?b)) <=> (Vec (+ ?a ?b) (+ 1 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?b)) <=> (Vec (+ ?a ?b) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?a)) <=> (Vec (+ ?b ?a) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b 1)) <=> (Vec (+ ?a ?b) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b 1)) <=> (Vec (+ ?b ?a) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec 1 ?b)) <=> (Vec (+ ?a 1) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?a ?b)) <=> (Vec (+ ?a 1) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?b)) <=> (Vec (+ ?b 1) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?a)) <=> (Vec (+ ?a 1) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec 1 ?b)) <=> (Vec (+ ?a 1) (+ 1 ?b))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b 1)) <=> (Vec (+ ?b 1) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?b)) <=> (Vec (+ ?a 1) (+ ?b ?b))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?a)) <=> (Vec (+ ?b 1) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?a ?b)) <=> (Vec (+ ?a ?a) (+ 1 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?a 1)) <=> (Vec (+ ?a ?a) (+ 1 ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* 0 ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* 0 ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* 0 ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec (* 0 ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec (* 0 ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* 0 ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec 1 ?a)) <=> (Vec (+ 1 ?a) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec 1 ?b)) <=> (Vec (+ 1 ?a) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?a ?b)) <=> (Vec (+ 1 ?a) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?b)) <=> (Vec (+ 1 ?b) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?b)) <=> (Vec (+ ?b ?a) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?a)) <=> (Vec (+ ?a ?b) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b 1)) <=> (Vec (+ ?b ?a) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b 1)) <=> (Vec (+ ?a ?b) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?a ?b)) <=> (Vec (+ ?a 1) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b ?b)) <=> (Vec (+ ?b 1) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec 1 ?b)) <=> (Vec (+ ?a 1) (+ ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?a) (* 0 ?b)) <=> (VecMul (Vec ?a 0) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?a) (* ?b 0)) <=> (VecMul (Vec ?a 0) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?a) (* 0 ?b)) <=> (VecMul (Vec ?a ?a) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?a) (* ?b 0)) <=> (VecMul (Vec ?a ?a) (Vec ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a ?b)) <=> (Vec (* ?a ?a) (* ?b 0))
cost: 100.80000000000001
(Vec (* ?a ?a) (* 0 ?b)) <=> (VecMul (Vec ?a 0) (Vec ?a ?a))
cost: 100.80000000000001
(Vec (* ?a ?a) (* ?b 0)) <=> (VecMul (Vec ?a 0) (Vec ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a ?b)) <=> (Vec (* ?a ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a ?b)) <=> (Vec (* ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?b 1)) <=> (Vec (+ ?b ?a) (+ 1 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?b)) <=> (Vec (+ ?b ?a) (+ 1 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?b 1)) <=> (Vec (+ ?a ?b) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?b ?a)) <=> (Vec (+ ?a ?b) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?b) (Vec ?a 1)) <=> (Vec (+ ?a ?a) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?a ?b)) <=> (Vec (+ ?a ?a) (+ ?b 1))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?a)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b ?b)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* ?b 0) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* ?a 0) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* ?b 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* 0 ?b)) <=> (VecMul (Vec 0 ?b) (Vec ?b 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* 0 ?b)) <=> (VecMul (Vec 0 ?a) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* 0 ?b)) <=> (VecMul (Vec ?b 0) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* 0 ?b)) <=> (VecMul (Vec ?a 0) (Vec 0 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?a) (* ?b 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b 0)) <=> (VecMul (Vec 0 ?b) (Vec ?b 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b 0)) <=> (VecMul (Vec 0 ?a) (Vec ?a 0))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?b) (* ?a 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b 0)) <=> (VecMul (Vec ?a 0) (Vec 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?b 0))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b 0)) <=> (VecMul (Vec ?b 0) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* 0 ?b)) <=> (VecMul (Vec ?b 0) (Vec 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* 0 ?b)) <=> (VecMul (Vec 0 ?a) (Vec ?a 0))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* ?a 0) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* ?b 0) (* 0 ?a))
cost: 100.80000000000001
(Vec (* ?a 0) (* 0 ?b)) <=> (VecMul (Vec 0 ?b) (Vec ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* 0 ?a))
cost: 100.80000000000001
(Vec (* ?a 0) (* 0 ?b)) <=> (VecMul (Vec ?a 0) (Vec 0 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b 0)) <=> (Vec (* 0 ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* 0 ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* 0 ?b) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* 0 ?b) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec (* 0 ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec (* 0 ?b) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* 0 ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* ?b 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* ?a 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?b)) <=> (Vec (* ?a 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec (* ?b 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?b)) <=> (Vec (* ?a 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?a)) <=> (Vec (* ?b 0) (* ?a ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?b)) <=> (VecMul (Vec 0 ?b) (Vec 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?b ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?a)) <=> (Vec (* 0 ?b) (* ?a ?a))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?b)) <=> (VecMul (Vec 0 ?b) (Vec ?b ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?b)) <=> (VecMul (Vec 0 ?b) (Vec 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* ?b ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?a)) <=> (Vec (* ?b 0) (* ?a ?a))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?b)) <=> (VecMul (Vec 0 ?b) (Vec ?b ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?b)) <=> (VecMul (Vec ?b ?b) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?b)) <=> (VecMul (Vec ?b ?b) (Vec 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?b) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?b ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?b ?a)) <=> (Vec (* 0 ?a) (* ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec 1 ?b)) <=> (Vec (+ ?a 1) (+ ?b 1))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?b 1)) <=> (Vec (+ ?b 1) (+ ?a 1))
cost: 100.80000000000001
(Vec (+ ?a ?a) (* ?b 0)) <=> (VecAdd (Vec ?a 0) (Vec ?a 0))
cost: 100.80000000000001
(Vec (+ ?a ?a) (* 0 ?b)) <=> (VecAdd (Vec ?a 0) (Vec ?a 0))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* ?a 0) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* ?b 0) (+ ?b ?a))
cost: 100.80000000000001
(Vec (* ?a 0) (+ ?b ?b)) <=> (VecAdd (Vec 0 ?b) (Vec 0 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?b 0)) <=> (Vec (+ ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (+ ?b ?a))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (+ ?a ?b))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (+ ?b ?a))
cost: 100.80000000000001
(Vec (* 0 ?a) (+ ?b ?b)) <=> (VecAdd (Vec 0 ?b) (Vec 0 ?b))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec 1 (+ ?b ?a))
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec 1 (+ ?b ?a))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec 1 (+ ?a ?b))
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec 1 (+ ?a ?b))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 1)) <=> (Vec (* ?a 0) ?a)
cost: 99.799
(VecMul (Vec ?a 1) (Vec 0 ?b)) <=> (Vec (* ?b 0) ?b)
cost: 99.799
(VecAdd (Vec ?a 1) (Vec 0 ?b)) <=> (Vec ?a (+ ?b 1))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?b 1)) <=> (Vec ?b (+ ?a 1))
cost: 99.799
(VecAdd (Vec ?a 1) (Vec ?b 0)) <=> (Vec (+ ?b ?a) 1)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b 1)) <=> (Vec (+ ?a ?b) 1)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?b 1)) <=> (Vec (+ ?b ?a) 1)
cost: 99.799
(VecAdd (Vec ?a 1) (Vec ?b 0)) <=> (Vec (+ ?a ?b) 1)
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b 0)) <=> (Vec ?b (* ?a 0))
cost: 99.799
(Vec ?a (* ?b 0)) <=> (VecMul (Vec 1 ?a) (Vec ?a 0))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 1 ?b)) <=> (Vec ?a (* ?b 0))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b 0)) <=> (Vec ?b (* 0 ?b))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 1 ?b)) <=> (Vec ?a (* 0 ?a))
cost: 99.799
(Vec ?a (* ?b 0)) <=> (VecMul (Vec ?a 0) (Vec 1 ?a))
cost: 99.799
(Vec (* ?a 0) ?b) <=> (VecMul (Vec ?b 1) (Vec 0 ?b))
cost: 99.799
(VecMul (Vec ?a 1) (Vec 0 ?b)) <=> (Vec (* ?a 0) ?b)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 1)) <=> (Vec (* ?b 0) ?a)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 1)) <=> (Vec (* 0 ?a) ?a)
cost: 99.799
(Vec (* 0 ?a) ?b) <=> (VecMul (Vec ?b 1) (Vec 0 ?b))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?b 1)) <=> (Vec (* 0 ?b) ?a)
cost: 99.799
(VecMul (Vec ?a 1) (Vec 0 ?b)) <=> (Vec (* 0 ?a) ?b)
cost: 99.799
(VecMul (Vec ?a 1) (Vec 0 ?b)) <=> (Vec (* 0 ?b) ?b)
cost: 99.799
(Vec (* ?a 0) ?b) <=> (VecMul (Vec 0 ?b) (Vec ?b 1))
cost: 99.799
(Vec (* 0 ?a) ?b) <=> (VecMul (Vec 0 ?b) (Vec ?b 1))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b 0)) <=> (Vec ?b (* ?b 0))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?b 0)) <=> (Vec ?b (* 0 ?a))
cost: 99.799
(Vec ?a (* 0 ?b)) <=> (VecMul (Vec ?a 0) (Vec 1 ?a))
cost: 99.799
(Vec ?a (* 0 ?b)) <=> (VecMul (Vec 1 ?a) (Vec ?a 0))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 1 ?b)) <=> (Vec ?a (* ?a 0))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 1 ?b)) <=> (Vec ?a (* 0 ?b))
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec ?b 0)) <=> (Vec (+ ?b 1) ?a)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec 1 ?b)) <=> (Vec (+ ?a 1) ?b)
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec ?b 0)) <=> (Vec (+ 1 ?b) ?a)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec 1 ?b)) <=> (Vec (+ 1 ?a) ?b)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?a ?b) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?b ?a) 0)
cost: 99.799
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec 0 (* ?a ?b))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec 0 (* ?b ?a))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec 0 (* ?b ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec 0 (* ?a ?b))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?b 1)) <=> (Vec ?b (+ 1 ?a))
cost: 99.799
(VecAdd (Vec ?a 1) (Vec 0 ?b)) <=> (Vec ?a (+ 1 ?b))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec (* ?a 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec (* 0 ?b) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec (* 0 ?a) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?b ?a))
cost: 100.80000000000001
(Vec (* ?a ?a) (* 0 ?b)) <=> (VecMul (Vec ?a 1) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?a) (* 0 ?b)) <=> (VecMul (Vec ?a 0) (Vec ?a 1))
cost: 100.80000000000001
(Vec (* ?a ?a) (* ?b 0)) <=> (VecMul (Vec ?a 1) (Vec ?a 0))
cost: 100.80000000000001
(Vec (* ?a ?a) (* ?b 0)) <=> (VecMul (Vec ?a 0) (Vec ?a 1))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?a ?b) (* ?b 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?a ?b) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?b 1)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?b 0)) <=> (Vec (* ?b ?a) (* 0 ?b))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec (* 0 ?b) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* 0 ?b) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec (* 0 ?a) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* ?b 0) (* ?a ?b))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec (* ?a 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?b)) <=> (Vec (* ?a 0) (* ?b ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 1 ?b)) <=> (Vec (* ?b 0) (* ?a ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?b)) <=> (VecMul (Vec 0 ?b) (Vec 1 ?b))
cost: 100.80000000000001
(Vec (* 0 ?a) (* ?b ?b)) <=> (VecMul (Vec 1 ?b) (Vec 0 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?b)) <=> (VecMul (Vec 0 ?b) (Vec 1 ?b))
cost: 100.80000000000001
(Vec (* ?a 0) (* ?b ?b)) <=> (VecMul (Vec 1 ?b) (Vec 0 ?b))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?a ?a)) <=> (Vec (* ?a ?a) (* ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?a ?a)) <=> (Vec (+ ?a ?a) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?a ?a)) <=> (Vec (+ ?a ?a) ?a)
cost: 99.799
(VecAdd (Vec ?a ?a) (Vec ?a 0)) <=> (Vec (+ ?a ?a) ?a)
cost: 99.799
(VecAdd (Vec ?a ?a) (Vec 0 ?a)) <=> (Vec ?a (+ ?a ?a))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?a ?a)) <=> (Vec ?a (+ ?a ?a))
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?a ?a)) <=> (Vec (* ?a ?a) ?a)
cost: 99.799
(VecMul (Vec ?a ?a) (Vec ?a 1)) <=> (Vec (* ?a ?a) ?a)
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?a ?a)) <=> (Vec ?a (* ?a ?a))
cost: 99.799
(VecMul (Vec ?a ?a) (Vec 1 ?a)) <=> (Vec ?a (* ?a ?a))
cost: 99.799
(Vec 0 ?a) <=> (Vec (* ?a 0) ?a)
cost: 100.901
(Vec ?a 0) <=> (Vec ?a (* 0 ?a))
cost: 100.901
(Vec 0 ?a) <=> (Vec (* 0 ?a) ?a)
cost: 100.901
(Vec ?a 0) <=> (Vec ?a (* ?a 0))
cost: 100.901
(VecAdd (Vec ?a 0) (Vec ?a 0)) <=> (Vec (+ ?a ?a) 0)
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?a 1)) <=> (Vec (* ?a ?a) 1)
cost: 99.799
(VecMul (Vec 1 ?a) (Vec 1 ?a)) <=> (Vec 1 (* ?a ?a))
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?a 0)) <=> (Vec (* ?a ?a) 0)
cost: 99.799
(VecMul (Vec ?a ?a) (Vec ?a 0)) <=> (Vec (* ?a ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?a ?a)) <=> (Vec (* ?a ?a) 0)
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec 0 ?a)) <=> (Vec 0 (+ ?a ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a 0)) <=> (Vec 0 (* ?a 0))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a 0)) <=> (Vec (* ?a 0) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a 0)) <=> (Vec (* 0 ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?a)) <=> (Vec (* 0 ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?a)) <=> (Vec 0 (* ?a 0))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?a)) <=> (Vec (* ?a 0) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a 0)) <=> (Vec 0 (* 0 ?a))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 0 ?a)) <=> (Vec 0 (* 0 ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 0 ?a)) <=> (Vec 0 (* ?a ?a))
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a ?a)) <=> (Vec 0 (* ?a ?a))
cost: 99.799
(VecMul (Vec ?a ?a) (Vec 0 ?a)) <=> (Vec 0 (* ?a ?a))
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec ?a 1)) <=> (Vec (+ 1 ?a) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec 1 ?a)) <=> (Vec (+ 1 ?a) (+ 1 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?a)) <=> (Vec (* ?a 0) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?a)) <=> (Vec (* ?a 0) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?a)) <=> (Vec (* ?a 0) (* ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?a ?a)) <=> (Vec (+ ?a ?a) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?a 1)) <=> (Vec (+ ?a ?a) (+ 1 ?a))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?a 1)) <=> (Vec (+ ?a 1) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec 1 ?a)) <=> (Vec (+ ?a 1) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec 1 ?a)) <=> (Vec (+ ?a 1) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?a ?a)) <=> (Vec (+ ?a 1) (+ ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a ?a)) <=> (Vec (* ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec 1 ?a)) <=> (Vec (+ 1 ?a) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec 1 ?a) (Vec ?a ?a)) <=> (Vec (+ 1 ?a) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a ?a) (Vec ?a 1)) <=> (Vec (+ ?a ?a) (+ ?a 1))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec ?a ?a)) <=> (Vec (+ ?a ?a) (+ ?a 1))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a ?a)) <=> (Vec (* ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a 0)) <=> (Vec (* ?a 0) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?a)) <=> (Vec (* ?a 0) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a 0)) <=> (Vec (* 0 ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec 0 ?a)) <=> (Vec (* 0 ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 0 ?a)) <=> (Vec (* 0 ?a) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec ?a ?a)) <=> (Vec (* 0 ?a) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a ?a) (Vec 0 ?a)) <=> (Vec (* 0 ?a) (* ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?a 0)) <=> (Vec (+ ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecAdd (Vec ?a 0) (Vec ?a 0)) <=> (Vec (+ ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?a)) <=> (Vec (* 0 ?a) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec 0 ?a) (Vec 0 ?a)) <=> (Vec (* ?a 0) (+ ?a ?a))
cost: 100.80000000000001
(VecAdd (Vec ?a 1) (Vec 0 ?a)) <=> (Vec ?a (+ 1 ?a))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec 1 ?a)) <=> (Vec 1 (+ ?a ?a))
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec 0 ?a)) <=> (Vec 1 (+ ?a ?a))
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec ?a 0)) <=> (Vec (+ ?a 1) ?a)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec 1 ?a)) <=> (Vec (+ ?a 1) ?a)
cost: 99.799
(VecMul (Vec ?a 1) (Vec 0 ?a)) <=> (Vec (* ?a 0) ?a)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a 1)) <=> (Vec (* ?a 0) ?a)
cost: 99.799
(VecAdd (Vec ?a 1) (Vec ?a 0)) <=> (Vec (+ ?a ?a) 1)
cost: 99.799
(VecAdd (Vec ?a 0) (Vec ?a 1)) <=> (Vec (+ ?a ?a) 1)
cost: 99.799
(VecAdd (Vec ?a 1) (Vec 0 ?a)) <=> (Vec ?a (+ ?a 1))
cost: 99.799
(VecAdd (Vec 0 ?a) (Vec ?a 1)) <=> (Vec ?a (+ ?a 1))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?a 0)) <=> (Vec ?a (* 0 ?a))
cost: 99.799
(VecMul (Vec ?a 0) (Vec 1 ?a)) <=> (Vec ?a (* 0 ?a))
cost: 99.799
(VecMul (Vec ?a 1) (Vec 0 ?a)) <=> (Vec (* 0 ?a) ?a)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec ?a 1)) <=> (Vec (* 0 ?a) ?a)
cost: 99.799
(VecMul (Vec ?a 0) (Vec 1 ?a)) <=> (Vec ?a (* ?a 0))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec ?a 0)) <=> (Vec ?a (* ?a 0))
cost: 99.799
(VecMul (Vec ?a 1) (Vec ?a 0)) <=> (Vec (* ?a ?a) 0)
cost: 99.799
(VecMul (Vec ?a 0) (Vec ?a 1)) <=> (Vec (* ?a ?a) 0)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 1 ?a)) <=> (Vec 0 (* ?a ?a))
cost: 99.799
(VecMul (Vec 1 ?a) (Vec 0 ?a)) <=> (Vec 0 (* ?a ?a))
cost: 99.799
(VecAdd (Vec ?a 0) (Vec 1 ?a)) <=> (Vec (+ 1 ?a) ?a)
cost: 99.799
(VecAdd (Vec 1 ?a) (Vec ?a 0)) <=> (Vec (+ 1 ?a) ?a)
cost: 99.799
(VecMul (Vec 0 ?a) (Vec 1 ?a)) <=> (Vec (* ?a 0) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?a)) <=> (Vec (* ?a 0) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a 1)) <=> (Vec (* ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* ?a 0))
cost: 100.80000000000001
(VecMul (Vec ?a 1) (Vec ?a 0)) <=> (Vec (* ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec ?a 0) (Vec ?a 1)) <=> (Vec (* ?a ?a) (* 0 ?a))
cost: 100.80000000000001
(VecMul (Vec 0 ?a) (Vec 1 ?a)) <=> (Vec (* 0 ?a) (* ?a ?a))
cost: 100.80000000000001
(VecMul (Vec 1 ?a) (Vec 0 ?a)) <=> (Vec (* 0 ?a) (* ?a ?a))
cost: 100.80000000000001
# kept/total: 654 / 2740
#+end_example

Ok, I'm not entirely certain what to do with these rules. I guess there are some objective (non-heuristic) questions. Are strictly more general rules always better? I'm going to postpone answering this question.

** Summary

*** Nov 22
**** Progress

You can use a /cost differential/ metric to score rules. The cost differential is just applying the cost function to the left and right hand sides of a rewrite rule. The idea is to capture the rules that "move in the right direction" w.r.t to the cost function. This metric seems to correctly select rules that push =Vec= down as far as they can go while retaining the program semantics by transforming =ops= to =vec-ops=.

However, we still end up with lots of stupid and redundant rules which are all possible combinations of scalar rules but inside of vectors. The next step is to start looking for rules that increase the size of the graph in interesting ways (but don't have a cost differential directly). The trick will be to pin down what "interesting ways" means precisely. The broad idea I'm working with atm is that we sometimes need to make the graph bigger to discover when particular rewrite rules will be able to apply. One example is that we need to first change + into VecAdd and * into VecMul before we can use VecMAC at all. Finding a metric that captures this idea and using them to filter rewrite rules is the next step.

To summarize, there are two types of rules that we are looking for:
1) Rules that directly decrease the cost function (using this idea of the cost differential)
2) Rules that increase the graph to create opportunities for the cost lowering rules to apply.

There are still some scaling problems to be solved. With the Vector rules enabled, we generate an absurd number of rules (36448 with current settings). This is so many rules. Many of these are just small variations of each other. It would be nice to not generate these rules. Seeding some initial rules may be a good way around this problem. But it's still not an ideal solution in the long term.

**** Vision progress

This technique of automatically generating rewrite rules is moving in the direction of automatic synthesis of compilers. This is an interesting problem because compilers are widely used across domains (even in domains where you would not quite expect such as biology. There they are interested in creating programs that model the behavior of some biological system so that they can then study the program to try and find insight) and very difficult and time consuming to write. Most of the time you don't actually care all that much about the performance of the compiler and so it's fine to generate something that isn't necessarily the fastest.

The problem that I'm currently working on can be phrased something like the following:
Given a language, an interpreter that gives semantics to the language, and a monotonic cost function (in the egg sense), can we synthesize a compiler that transforms arbitrary subsets of the language into the optimal subset (as defined by the cost function).

The general outline that is emerging:
1) Run ruler with the language interpreter to generate a set of rewrite rules that covers the semantics of the language.
2) Run a dios-like compiler that uses egraphs and the set of rules to search over a space of programs to find a low cost equivalent program.

The hard question is coming up with a set of rewrite rules that enable the second part of the compiler to perform well. If we choose the wrong set of rewrite rules the dios compiler will take a long time (read fail to terminate) and or not find a good program.

* ideas that came up while working on other sections

** Scoring rules via the cost function to estimate how much their application could help

** How do we find "redundant" rules? Maybe having the redundant rules are better than having the composite rules?

** Building up programs that don't cost that much, then build up programs that cost a lot, and use ruler to find equivalences between them. 

We could also do the simpler thing of first getting all the ruler rules, and then scoring them and only keeping the rules above a certain threshold.

This will encourage it to find rules that decrease the cost by a lot.

** Are strictly more general rules always better?

For example, consider these two rules:
#+begin_example
(VecMul (Vec ?a ?b) (Vec ?c ?d)) <=> (Vec (* ?a ?c) (* ?b ?d))
(VecMul (Vec ?a ?b) (Vec ?b ?c)) <=> (Vec (* ?a ?b) (* ?c ?b))
#+end_example

The second rule is a sub-case of the first one. Is there any difference between including both rules, just having the first rule, or just having the second rule?

